#include "zf_common_headfile.h"
#include "encoder.h"

int16_t encoder1 = 0;
int16_t encoder2 = 0;

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     编码器初始化
// 参数说明     void
// 返回参数     void
// 使用示例     encoder_init();
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
void encoder_init()
{
    // 初始化编码器并清零
    encoder_quad_init(ENCODER1_TIM, ENCODER1_PIN1, ENCODER1_PIN2);
    encoder_quad_init(ENCODER2_TIM, ENCODER2_PIN1, ENCODER2_PIN2);
    encoder_clear_count(ENCODER1_TIM);
    encoder_clear_count(ENCODER1_TIM);
}

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     编码器计数刷新
// 参数说明     void
// 返回参数     void
// 使用示例     encoder_refresh();
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
void encoder_refresh()
{
    encoder1 = encoder_get_count(ENCODER1_TIM);
    encoder2 = encoder_get_count(ENCODER2_TIM);
    encoder_clear_count(ENCODER1_TIM);
    encoder_clear_count(ENCODER2_TIM);
}

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     读取encoder1的值
// 参数说明     void
// 返回参数     encoder1的值(int16_t)
// 使用示例     encoder1_get();
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
int16_t encoder1_get()
{
    return encoder1;
}

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     读取encoder2的值
// 参数说明     void
// 返回参数     encoder2的值(int16_t)
// 使用示例     encoder2_get();
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
int16_t encoder2_get()
{
    return encoder2;
}

