#ifndef __IMAGPROCESS_H
#define __IMAGPROCESS_H

#include "zf_common_headfile.h"

//================================================声明全局变量================================================
extern uint8 binary_imag[MT9V03X_H][MT9V03X_W]; // 二值化后的图像
//================================================声明全局变量================================================

//====================================================图像处理基础函数====================================================
void imag_adaptiveThresholdadaptiveThreshold(uint8_t* img_data, uint8_t* output_data, int width, int height, int block, uint8_t clip_value);// 自适应二值化
void imag_proc();
//====================================================图像处理基础函数====================================================

#endif
