#include "zf_common_headfile.h"
#include "servo.h"

// 限幅函数，仅用于当前文件
float constrain_angle(float amt)//限幅
{
  return ((amt)<(SERVO_ANGLE_MIN)?(SERVO_ANGLE_MIN):((amt) >(SERVO_ANGLE_MAX)?(SERVO_ANGLE_MAX):(amt)));
}
//-------------------------------------------------------------------------------------------------------------------
// 函数简介     根据输入角度计算舵机占空比
// 参数说明     angle 转向角(SERVO_ANGLE_MIN < angle < SERVO_ANGLE_MAX)
// 返回参数     舵机正中时对应的(占空比 * PWM_DUTY_MAX)的值
// 使用示例     servo_duty(0);返回舵机正中时对应的(占空比 * PWM_DUTY_MAX)的值,用于直接应用于pwm_init函数的占空比设置
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
uint32_t servo_duty(float angle)
{
    angle = constrain_angle(angle);
    angle += SERVO_MID;
    return (angle * 2 / 180 + 0.5) * PWM_DUTY_MAX * SERVO_FRE / 1000;
}


//-------------------------------------------------------------------------------------------------------------------
// 函数简介     舵机初始化
// 参数说明     void
// 返回参数     void
// 使用示例     servo_init();
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
void servo_init()
{
    pwm_init(SERVO_SIG_PIN, SERVO_FRE, servo_duty(0));
}

//-------------------------------------------------------------------------------------------------------------------
// 函数简介     舵机角度设置
// 参数说明     angle 设定角度值(正值向左,负值向右)
// 返回参数     void
// 使用示例     servo_setangle(5);
// 备注信息
//-------------------------------------------------------------------------------------------------------------------
void servo_setangle(float angle)
{
    pwm_set_duty(SERVO_SIG_PIN, servo_duty(angle));
}
